MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM471F10/mcu.h
/**
 *******************************************************************************
 * @file    TMPM471F10.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM471F10' Device Series
 * @version V1.0.0.0
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
  * Copyright(C) Toshiba Electronic Device Solutions Corporation 2024
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM471F10
  * @{
  */

#ifndef __TMPM471F10_H__
#define __TMPM471F10_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM471F10 Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< External interrupt 0                                        */
  INT1_IRQn                     = 1,         /*!< External interrupt 1                                        */
  INT2_IRQn                     = 2,         /*!< External interrupt 2                                        */
  INT3_IRQn                     = 3,         /*!< External interrupt 3                                        */
  INT4_IRQn                     = 4,         /*!< External interrupt 4                                        */
  INT5_IRQn                     = 5,         /*!< External interrupt 5                                        */
  INT6_IRQn                     = 6,         /*!< External interrupt 6                                        */
  INT7_IRQn                     = 7,         /*!< External interrupt 7                                        */
  INT8_IRQn                     = 8,         /*!< External interrupt 8                                        */
  INT9_IRQn                     = 9,         /*!< External interrupt 9                                        */
  INTA_IRQn                     = 10,        /*!< External interrupt A                                        */
  INTB_IRQn                     = 11,        /*!< External interrupt B                                        */
  INTC_IRQn                     = 12,        /*!< External interrupt C                                        */
  INTD_IRQn                     = 13,        /*!< External interrupt D                                        */
  INTE_IRQn                     = 14,        /*!< External interrupt E                                        */
  INTF_IRQn                     = 15,        /*!< External interrupt F                                        */
  INTEMG0_IRQn                  = 16,        /*!< A-PMD ch0 EMG Interrupt                                     */
  INTEMG1_IRQn                  = 17,        /*!< A-PMD ch1 EMG Interrupt                                     */
  INTOVV0_IRQn                  = 18,        /*!< A-PMD ch0 OVV Interrupt                                     */
  INTOVV1_IRQn                  = 19,        /*!< A-PMD ch1 OVV Interrupt                                     */
  INTPWM0_IRQn                  = 20,        /*!< A-PMD ch0 PWM Interrupt                                     */
  INTPWM1_IRQn                  = 21,        /*!< A-PMD ch1 PWM Interrupt                                     */
  INTENC00_IRQn                 = 22,        /*!< A-ENC32 ch0 Encoder input interrupt 0                       */
  INTENC01_IRQn                 = 23,        /*!< A-ENC32 ch0 Encoder input interrupt 1                       */
  INTENC10_IRQn                 = 24,        /*!< A-ENC32 ch1 Encoder input interrupt 0                       */
  INTENC11_IRQn                 = 25,        /*!< A-ENC32 ch1 Encoder input interrupt 1                       */
  INTADAPDA_IRQn                = 26,        /*!< ADC unit A PMD trigger program conversion complete A        */
  INTADAPDB_IRQn                = 27,        /*!< ADC unit A PMD trigger program conversion complete B        */
  INTADACP0_IRQn                = 28,        /*!< ADC unit A Monitor function 0 interrupt                     */
  INTADACP1_IRQn                = 29,        /*!< ADC unit A Monitor function 1 interrupt                     */
  INTADATRG_IRQn                = 30,        /*!< ADC unit A general trigger program conversion complete      */
  INTADASGL_IRQn                = 31,        /*!< ADC unit A single program conversion completion             */
  INTADACNT_IRQn                = 32,        /*!< ADC unit A continuous program conversion complete           */
  INTADBPDA_IRQn                = 33,        /*!< ADC unit B PMD trigger program conversion complete A        */
  INTADBPDB_IRQn                = 34,        /*!< ADC unit B PMD trigger program conversion complete B        */
  INTADBCP0_IRQn                = 35,        /*!< ADC unit B Monitor function 0 interrupt                     */
  INTADBCP1_IRQn                = 36,        /*!< ADC unit B Monitor function 1 interrupt                     */
  INTADBTRG_IRQn                = 37,        /*!< ADC unit B general trigger program conversion complete      */
  INTADBSGL_IRQn                = 38,        /*!< ADC unit B single program conversion completion             */
  INTADBCNT_IRQn                = 39,        /*!< ADC unit B continuous program conversion complete           */
  INTSC0RX_IRQn                 = 40,        /*!< TSPI ch0 reception interrupt /UART ch0 reception interrupt  */
  INTSC0TX_IRQn                 = 41,        /*!< TSPI ch0 transmit interrupt /UART ch0 transmit interrupt    */
  INTSC0ERR_IRQn                = 42,        /*!< TSPI ch0 error interrupt /UART ch0 error interrupt          */
  INTSC1RX_IRQn                 = 43,        /*!< TSPI ch1 reception interrupt /UART ch1 reception interrupt  */
  INTSC1TX_IRQn                 = 44,        /*!< TSPI ch1 transmit interrupt /UART ch1 transmit interrupt    */
  INTSC1ERR_IRQn                = 45,        /*!< TSPI ch1 error interrupt /UART ch1 error interrupt          */
  INTSC2RX_IRQn                 = 46,        /*!< TSPI ch2 reception interrupt /UART ch2 reception interrupt  */
  INTSC2TX_IRQn                 = 47,        /*!< TSPI ch2 transmit interrupt /UART ch2 transmit interrupt    */
  INTSC2ERR_IRQn                = 48,        /*!< TSPI ch2 error interrupt /UART ch2 error interrupt          */
  INTSC3RX_IRQn                 = 49,        /*!< TSPI ch3 reception interrupt /UART ch3 reception interrupt  */
  INTSC3TX_IRQn                 = 50,        /*!< TSPI ch3 transmit interrupt /UART ch3 transmit interrupt    */
  INTSC3ERR_IRQn                = 51,        /*!< TSPI ch3 error interrupt /UART ch3 error interrupt          */
  INTUART4RX_IRQn               = 52,        /*!< UART ch4 reception interrupt                                */
  INTUART4TX_IRQn               = 53,        /*!< UART ch4 transmit interrupt                                 */
  INTUART4ERR_IRQn              = 54,        /*!< UART ch4 error interrupt                                    */
  INTI2C0ST_IRQn                = 55,        /*!< EI2C ch0 status interrupt                                   */
  INTI2C0TBE_IRQn               = 56,        /*!< EI2C ch0 transmit buffer empty interrupt                    */
  INTI2C0RBF_IRQn               = 57,        /*!< EI2C ch0 receive buffer full interrupt                      */
  INTI2C1ST_IRQn                = 58,        /*!< EI2C ch1 status interrupt                                   */
  INTI2C1TBE_IRQn               = 59,        /*!< EI2C ch1 transmit buffer empty interrupt                    */
  INTI2C1RBF_IRQn               = 60,        /*!< EI2C ch1 receive buffer full interrupt                      */
  INTT32A00AC_IRQn              = 61,        /*!< T32A ch0 timer A/C match, overflow, and underflow           */
  INTT32A00ACCAP0_IRQn          = 62,        /*!< T32A ch0 timer A/C capture 0                                */
  INTT32A00ACCAP1_IRQn          = 63,        /*!< T32A ch0 timer A/C capture 1                                */
  INTT32A00B_IRQn               = 64,        /*!< T32A ch0 timer B match, overflow, and underflow             */
  INTT32A00BCAP0_IRQn           = 65,        /*!< T32A ch0 timer B capture 0                                  */
  INTT32A00BCAP1_IRQn           = 66,        /*!< T32A ch0 timer B capture 1                                  */
  INTT32A01AC_IRQn              = 67,        /*!< T32A ch1 timer A/C match, Overflow, and underflow           */
  INTT32A01ACCAP0_IRQn          = 68,        /*!< T32A ch1 timer A/C capture 0                                */
  INTT32A01ACCAP1_IRQn          = 69,        /*!< T32A ch1 timer A/C capture 1                                */
  INTT32A01B_IRQn               = 70,        /*!< T32A ch1 timer B match, overflow, and underflow             */
  INTT32A01BCAP0_IRQn           = 71,        /*!< T32A ch1 timer B capture 0                                  */
  INTT32A01BCAP1_IRQn           = 72,        /*!< T32A ch1 timer B capture 1                                  */
  INTT32A02AC_IRQn              = 73,        /*!< T32A ch2 timer A/C match, overflow, and underflow           */
  INTT32A02ACCAP0_IRQn          = 74,        /*!< T32A ch2 timer A/C capture 0                                */
  INTT32A02ACCAP1_IRQn          = 75,        /*!< T32A ch2 timer A/C capture 1                                */
  INTT32A02B_IRQn               = 76,        /*!< T32A ch2 timer B match, overflow, and underflow             */
  INTT32A02BCAP0_IRQn           = 77,        /*!< T32A ch2 timer B capture 0                                  */
  INTT32A02BCAP1_IRQn           = 78,        /*!< T32A ch2 timer B capture 1                                  */
  INTT32A03AC_IRQn              = 79,        /*!< T32A ch3 timer A/C match, overflow, and underflow           */
  INTT32A03ACCAP0_IRQn          = 80,        /*!< T32A ch3 timer A/C capture 0                                */
  INTT32A03ACCAP1_IRQn          = 81,        /*!< T32A ch3 timer A/C capture 1                                */
  INTT32A03B_IRQn               = 82,        /*!< T32A ch3 timer B match, overflow, and underflow             */
  INTT32A03BCAP0_IRQn           = 83,        /*!< T32A ch3 timer B capture 0                                  */
  INTT32A03BCAP1_IRQn           = 84,        /*!< T32A ch3 timer B capture 1                                  */
  INTT32A04AC_IRQn              = 85,        /*!< T32A ch4 timer A/C match, overflow, and underflow           */
  INTT32A04ACCAP0_IRQn          = 86,        /*!< T32A ch4 timer A/C capture 0                                */
  INTT32A04ACCAP1_IRQn          = 87,        /*!< T32A ch4 timer A/C capture 1                                */
  INTT32A04B_IRQn               = 88,        /*!< T32A ch4 timer B match, overflow, and underflow             */
  INTT32A04BCAP0_IRQn           = 89,        /*!< T32A ch4 timer B capture 0                                  */
  INTT32A04BCAP1_IRQn           = 90,        /*!< T32A ch4 timer B capture 1                                  */
  INTPARI0_IRQn                 = 91,        /*!< RAM Parity interrupt 0                                      */
  INTPARI1_IRQn                 = 92,        /*!< RAM Parity interrupt 1                                      */
  INTDMAATC_IRQn                = 93,        /*!< DMAC transfer completion interrupt (ch0 to 31)              */
  INTDMAAERR_IRQn               = 94,        /*!< DMAC transfer error interrupt                               */
  INTFLCRDY_IRQn                = 95         /*!< Code FLASH Ready interrupt                                  */
} IRQn_Type;

